Denzerek/PSoC-6-BLE-ARM/MainProject/BT_Peripheral_Controller.cydsn/Generated_Source/PSoC6/I2C_ARD.h
/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: I2C_ARD_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_ARD_Init(cy_stc_scb_i2c_config_t const *config)
{
    return Cy_SCB_I2C_Init(I2C_ARD_HW, config, &I2C_ARD_context);
}


/*******************************************************************************
*  Function Name: I2C_ARD_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_DeInit(void)
{
    Cy_SCB_I2C_DeInit(I2C_ARD_HW);
}


/*******************************************************************************
* Function Name: I2C_ARD_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_Enable(void)
{
    Cy_SCB_I2C_Enable(I2C_ARD_HW);
}


/*******************************************************************************
* Function Name: I2C_ARD_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_Disable(void)
{
    Cy_SCB_I2C_Disable(I2C_ARD_HW, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_SetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ARD_SetDataRate(uint32_t dataRateHz, uint32_t scbClockHz)
{
    return Cy_SCB_I2C_SetDataRate(I2C_ARD_HW, dataRateHz, scbClockHz);
}


/*******************************************************************************
* Function Name: I2C_ARD_GetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_GetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ARD_GetDataRate(uint32_t scbClockHz)
{
    return Cy_SCB_I2C_GetDataRate(I2C_ARD_HW, scbClockHz);
}


/*******************************************************************************
* Function Name: I2C_ARD_RegisterEventCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterEventCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_RegisterEventCallback(cy_cb_scb_i2c_handle_events_t callback)
{
    Cy_SCB_I2C_RegisterEventCallback(I2C_ARD_HW, callback, &I2C_ARD_context);
}


#if (I2C_ARD_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_ARD_RegisterAddrCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterAddrCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_RegisterAddrCallback(cy_cb_scb_i2c_handle_addr_t callback)
{
    Cy_SCB_I2C_RegisterAddrCallback(I2C_ARD_HW, callback, &I2C_ARD_context);
}
#endif /* (I2C_ARD_ENABLE_SLAVE) */


/*******************************************************************************
* Function Name: I2C_ARD_IsBusBusy
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_IsBusBusy() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool I2C_ARD_IsBusBusy(void)
{
    return Cy_SCB_I2C_IsBusBusy(I2C_ARD_HW);
}


#if (I2C_ARD_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_ARD_SlaveSetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_SlaveSetAddress(uint8_t addr)
{
    Cy_SCB_I2C_SlaveSetAddress(I2C_ARD_HW, addr);
}


/*******************************************************************************
* Function Name: I2C_ARD_SlaveGetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ARD_SlaveGetAddress(void)
{
    return Cy_SCB_I2C_SlaveGetAddress(I2C_ARD_HW);
}


/*******************************************************************************
* Function Name: I2C_ARD_SlaveSetAddressMask
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveSetAddressMask() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_SlaveSetAddressMask(uint8_t addrMask)
{
    Cy_SCB_I2C_SlaveSetAddressMask(I2C_ARD_HW, addrMask);
}


/*******************************************************************************
* Function Name: I2C_ARD_SlaveGetAddressMask
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddressMask() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ARD_SlaveGetAddressMask(void)
{
    return Cy_SCB_I2C_SlaveGetAddressMask(I2C_ARD_HW);
}
#endif /* (I2C_ARD_ENABLE_SLAVE) */

#if (I2C_ARD_ENABLE_MASTER)
/*******************************************************************************
* Function Name: I2C_ARD_MasterSetLowPhaseDutyCycle
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSetLowPhaseDutyCycle() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_MasterSetLowPhaseDutyCycle(uint32_t clockCycles)
{
    Cy_SCB_I2C_MasterSetLowPhaseDutyCycle(I2C_ARD_HW, clockCycles);
}


