Denzerek/PSoC-6-BLE-ARM/MainProject/BT_Peripheral_Controller.cydsn/Generated_Source/PSoC6/I2C_ARD.h
/*******************************************************************************
* Function Name: I2C_ARD_MasterAbortRead
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterAbortRead() PDL driver function.
*
******************************************************************************/
__STATIC_INLINE void I2C_ARD_MasterAbortRead(void)
{
    Cy_SCB_I2C_MasterAbortRead(I2C_ARD_HW, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_MasterWrite
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterWrite() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_ARD_MasterWrite(cy_stc_scb_i2c_master_xfer_config_t *xferConfig)
{
    return Cy_SCB_I2C_MasterWrite(I2C_ARD_HW, xferConfig, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_MasterAbortWrite
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterAbortWrite() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_MasterAbortWrite(void)
{
    Cy_SCB_I2C_MasterAbortWrite(I2C_ARD_HW, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_MasterGetTransferCount
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterGetTransferCount() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ARD_MasterGetTransferCount(void)
{
    return Cy_SCB_I2C_MasterGetTransferCount(I2C_ARD_HW, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_MasterSendStart
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSendStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_ARD_MasterSendStart(uint32_t address, cy_en_scb_i2c_direction_t bitRnW, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterSendStart(I2C_ARD_HW, address, bitRnW, timeoutMs, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_MasterSendReStart
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSendReStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_ARD_MasterSendReStart(uint32_t address, cy_en_scb_i2c_direction_t bitRnW, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterSendReStart(I2C_ARD_HW, address, bitRnW, timeoutMs, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_MasterSendStop
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSendStop() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_ARD_MasterSendStop(uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterSendStop(I2C_ARD_HW, timeoutMs, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_MasterReadByte
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterReadByte() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_ARD_MasterReadByte(cy_en_scb_i2c_command_t ackNack, uint8_t *byte, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterReadByte(I2C_ARD_HW, ackNack, byte, timeoutMs, &I2C_ARD_context);
}


/*******************************************************************************
* Function Name: I2C_ARD_MasterWriteByte
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterWriteByte() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_ARD_MasterWriteByte(uint8_t byte, uint32_t timeoutMs)
{
    return Cy_SCB_I2C_MasterWriteByte(I2C_ARD_HW, byte, timeoutMs, &I2C_ARD_context);
}
#endif /* (I2C_ARD_ENABLE_MASTER) */


/*******************************************************************************
* Function Name: I2C_ARD_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Interrupt() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ARD_Interrupt(void)
{
    Cy_SCB_I2C_Interrupt(I2C_ARD_HW, &I2C_ARD_context);
}

#if defined(__cplusplus)
}
#endif

#endif /* I2C_ARD_CY_SCB_I2C_PDL_H */


/* [] END OF FILE */
